{
  "login": {
    "title": "Login to IFCM",
    "email": "Email",
    "password": "Password",
    "login": "LOGIN",
    "passwordrequired": "Password is required",
    "forgot": "Forgot Password ?",
    "noaccount": "Don't have an account ?",
    "signup": " Sign Up",
    "invalid": "Invalid Email !!",
    "toomany": "Too many unsuccessful login attempts. Please try again later !!",
    "wrong": "Email or Password are Wrong!",
    "format": "Wrong format of Email !",
    "needs": "Email or Password needed !",
    "others": " Sign-in error :"
  },
  "forgotten": {
    "title": "Password forgotten",
    "email": "Email",
    "reset": "SEND RESET EMAIL",
    "noaccount": "Don't have an account ?",
    "signup": " Sign Up",
    "look": "Look your e-mail",
    "champ": "Need Email",
    "invalid": "Invalid Email !!",
    "toomany": "Too many unsuccessful login attempts. Please try again later !!",
    "unk": "User not found"
  },
  "signup": {
    "title": "Create your account",
    "firstname": "First Name",
    "lastname": "Last Name",
    "firstnamerequired": "First Name is required",
    "lastnamerequired": "Last Name is required",
    "email": "Email",
    "password": "Your Password",
    "passwordrequired": "Password is required",
    "confirmpassword": "Re-enter your Password",
    "confirmpasswordrequired": "Password is required",
    "create": "CREATE",
    "account": "Already have an account ?",
    "login": " Log in",
    "week": "Weak password!",
    "already": "Email already use!",
    "same": "Not the same",
    "champs": "All champs are required",
    "format": "Wrong format of Email !",
    "toomany": "Too many unsuccessful login attempts. Please try again later !!"
  },
  "home": {
    "morning": "Good morning",
    "afternoon": "Good afternoon",
    "evening": "Good evening",
    "verse": "Verse of the day",
    "events": "Upcoming Events",
    "prophetic": "Prophetic Message",
    "copied":"Text Copied !"
  },
  "eventdetails": {
    "title": "Upcoming Events",
    "location": "Venue"
  },
  "shopping": {
    "title": "Shop",
    "all": "All",
    "livre": "Book",
    "media": "Media",
    "accessoire": "Accessory"
  },
  "shoppingcart": {
    "title": "Shopping Cart",
    "emptycart": "Your cart is empty",
    "total": "Total",
    "pay": "Pay"
  },
  "shoppingdetails": {
    "noitem": "No shopping item selected",
    "title": "Shop Book",
    "buy": "Buy now"
  },
  "teaching": {
    "title": "Find teaching",
    "topic": "Choose the topic you want to explore",
    "categories": "Categories"
  },
  "teachinglist": {
    "notfound": "Teaching category not found",
    "title": "Teaching",
    "text": "All texts",
    "lessons":"Lessons",
    "subtitle":"Text"

  },
  "teachingorder": {
    "noitem": "The is no teaching to purchase",
    "shop": "Shop now for",
    "purchase": "Purchase"
  },
  "teachingdetail": {
    "noitem": "The is no teaching to display"
  },
  "donation": {
    "title": "Donation",
    "support": "Support Impact For Christ Ministries Charitable Deeds",
    "howmuch": "How much wanna donate ? ",
    "cause": "Choose your cause",
    "tithe": "Tithe",
    "offer": "Offering",
    "itvn": "ITVN",
    "fund": "Building Fund",
    "hl": "HL",
    "charity": "Impact For Christ Ministries Charitable Deeds ",
    "location": "Location",
    "don": "Donate"
  },
  "profile": {
    "title": "Your account",
    "subtitle": "Profile informations and settings ",
    "edit": "Edit your informations",
    "order": "Orders",
    "help": "Help",
    "branch": "Branches",
    "notification": "Notifications",
    "aboutus": "About us",
    "privacy": "Privacy policy",
    "logout": "Logout"
  },
  "orderlist": {
    "title": "My Orders",
    "order": "Commande ",
    "noorder": "oops, something went wrong. Swipe down to refresh the list",
    "last": "Last Orders",
    "shippingstatus": "Shipping Status : ",
    "orderstatus": "Order Status :"
  },
  "orderdetail": {
    "title": "Order detail",
    "noorder": "No order to display",
    "place": "Placer le ",
    "order": "Ordre",
    "receipt": "Get Receipt",
    "pay": "Paid",
    "paymentmethod": "PAYMENT METHOD",
    "shippingadress": "SHIPPING ADDRESS"
  },
  "help": {
    "title": " Need Help ?",
    "subtitle": "Send your message",
    "name": "Name",
    "namerror": "Username is required",
    "email": "Email",
    "emailerror": "Email is required",
    "subject": "Subject",
    "subjecterror": "Subject is required",
    "message": "Your Message",
    "messageerror": "Message is required",
    "champs": "All champs are required",
    "error":"Something Wrong",
    "success":"Successful",
    "send": "Send"
  },
  "branches": {
    "subtitle": "IFCM Branches Details",
    "select": "Select a branch",
    "location": "Location",
    "adress": "Physical Address",
    "contact": "Contact",
    "socialmedia": "Social Media"
  },
  "aboutus": {
    "title": "About Us",
    "who": "Who we are?",
    "whotext": "Impact for Christ Ministries is a revelation of the Church of the Lord Jesus Christ, governed by Him as the Head, according to the enunciation of the Holy Scriptures, the working of the Holy Spirit and the ministrations instituted by Jesus Himself. We are a ministry of the Lord Jesus Christ, where His name is lifted up high and His limitless power demonstrated – According to John 14:12, “Doing the works of Jesus Christ and greater works than He did for those who believe in Him.",
    "vision": "Vision",
    "visiontext": "John 14:12, “Doing the Works of Jesus Christ” Most assuredly, I say to you, he who believes in Me, the works that I do he will do also and greater works than these he will do, because I go to My Father.",
    "mission": "Mission",
    "missiontext": "To glorify God, to proclaim the Kingdom of God by preaching the Gospel of the Lord Jesus Christ through the power of The Holy Spirit. To minister to the needs of the total person. To develop, equip and release believers into ministry. To extend the influence of the church beyond its boundaries and abroad.",
    "stand": "What we stand for?",
    "stand1": "Prayer",
    "stand2": "Intensity of Prayer",
    "stand3": "High Praise",
    "stand4": "Strong Godly established relationships",
    "stand5": "Development and Empowerment of strong leadership",
    "stand6": "Healing and Deliverance",
    "stand7": "Release of Apostolic and Prophetic anointing",
    "stand8": "Breaking of Holy Communion bread",
    "stand9": "Apostolic liberal giving"
  },
  "legal": {
    "title": "PRIVACY POLICY",
    "date": "Effective date: January 04, 2019",
    "ifcm1": "Impact for Christ Ministries (“us“, “we“, or “our“) operates the http://www.impactforchristsa.com website (the “Service“).",
    "ifcm2": "This page informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Service and the choices you have associated with that data.",
    "ifcm3": "We use your data to provide and improve the Service. By using the Service, you agree to the collection and use of information in accordance with this policy. Unless otherwise defined in this Privacy Policy, terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, accessible from http://www.impactforchristsa.com",
    "info": "Information Collection And Use",
    "infotext": "We collect several different types of information for various purposes to provide and improve our Service to you.",
    "typedata": "Types of Data Collected",
    "personaldata": "Personal Data",
    "textdata": "While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you (“Personal Data“). Personally identifiable information may include, but is not limited to:",
    "email": "Email address",
    "first": "First name and last name",
    "phone": "Phone number",
    "adress": "Address, State, Province, ZIP/Postal code, City",
    "cookie": "Cookies and Usage Data",
    "usagedata": "Usage Data",
    "usagedatatext": "We may also collect information how the Service is accessed and used (“Usage Data“). This Usage Data may include information such as your computer's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.",
    "tacking": "Tracking & Cookies Data",
    "trackingtext": "We use cookies and similar tracking technologies to track the activity on our Service and hold certain information.",
    "cookiestext": "Cookies are files with small amount of data which may include an anonymous unique identifier. Cookies are sent to your browser from a website and stored on your device. Tracking technologies also used are beacons, tags, and scripts to collect and track information and to improve and analyze our Service.",
    "cookiestext1": "You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our Service.",
    "exemplecookie": "Examples of Cookies we use : ",
    "session": "Session Cookies.",
    "session1": "We use Session Cookies to operate our Service.",
    "preference": "Preference Cookies",
    "preference1": "We use Preference Cookies to remember your preferences and various settings.",
    "security": "Security Cookies",
    "security1": "We use Security Cookies for security purposes.",
    "usedata": "Use of Data",
    "usedatasub": "Impact for Christ Ministries uses the collected data for various purposes:",
    "usedatatext1": "To provide and maintain the Service",
    "usedatatext2": "To notify you about changes to our Service",
    "usedatatext3": "To allow you to participate in interactive features of our Service when you choose to do so",
    "usedatatext4": "To provide customer care and support",
    "usedatatext5": "To provide analysis or valuable information so that we can improve the Service",
    "usedatatext6": "To monitor the usage of the Service",
    "usedatatext7": "To detect, prevent and address technical issues",
    "transferdata": "Transfer Of Data",
    "transferdatatext": "Your information, including Personal Data, may be transferred to — and maintained on — computers located outside of your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from your jurisdiction.",
    "transferdatatext1": "If you are located outside South Africa and choose to provide information to us, please note that we transfer the data, including Personal Data, to South Africa and process it there.",
    "transferdatatext2": "Your consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.",
    "transferdatatext3": "Impact for Christ Ministries will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this Privacy Policy and no transfer of your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of your data and other personal information.",
    "disclosure": "Disclosure Of Data",
    "legalrequir": "Legal Requirements",
    "ifcmlist": "Impact for Christ Ministries may disclose your Personal Data in the good faith belief that such action is necessary to: ",
    "ifcmlist1": "To comply with a legal obligation",
    "ifcmlist2": "To protect and defend the rights or property of Impact for Christ Ministries",
    "ifcmlist3": "To prevent or investigate possible wrongdoing in connection with the Service",
    "ifcmlist4": "To protect the personal safety of users of the Service or the public",
    "ifcmlist5": "To protect against legal liability",
    "securitydata": "Security Of Data",
    "securitydatatext": "The security of your data is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.",
    "serviceprovider": "Service Providers",
    "serviceprovidertext": "We may employ third party companies and individuals to facilitate our Service (“Service Providers“), to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.",
    "serviceprovidertext2": "These third parties have access to your Personal Data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.",
    "analytics": "Analytics",
    "analyticstext": "We may use third-party Service Providers to monitor and analyze the use of our Service.",
    "google": "Google Analytics",
    "googletext1": "Google Analytics is a web analytics service offered by Google that tracks and reports website traffic. Google uses the data collected to track and monitor the use of our Service. This data is shared with other Google services. Google may use the collected data to contextualize and personalize the ads of its own advertising network.",
    "googletext2": "You can opt-out of having made your activity on the Service available to Google Analytics by installing the Google Analytics opt-out browser add-on. The add-on prevents the Google",
    "googletext3": "Analytics JavaScript (ga.js, analytics.js, and dc.js) from sharing information with Google Analytics about visits activity.",
    "googletext4": "For more information on the privacy practices of Google, please visit the Google Privacy & Terms web page :",
    "othersite": "Links To Other Sites",
    "othersitetext1": "Our Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.",
    "othersitetext2": "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.",
    "childrenprivacy": "Children's Privacy",
    "childrenprivacytext1": "Our Service does not address anyone under the age of 18 (“Children“).",
    "childrenprivacytext2": "We do not knowingly collect personally identifiable information from anyone under the age of 18. If you are a parent or guardian and you are aware that your Children has provided us with Personal Data, please contact us. If we become aware that we have collected Personal Data from children without verification of parental consent, we take steps to remove that information from our servers.",
    "privacypolicy": "Changes To This Privacy Policy",
    "privacypolicytext1": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.",
    "privacypolicytext2": "We will let you know via email and/or a prominent notice on our Service, prior to the change becoming effective and update the “effective date“ at the top of this Privacy Policy.",
    "privacypolicytext3": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.",
    "contact": "Contact Us",
    "contactext": "If you have any questions about this Privacy Policy, please contact us by mail :",
    "copyright": "Copyright",
    "copyrightext": "This app is brought to you by ElyoTech Pty Ltd.",
    "emailtext": "We would love to hear from you, so please do send us an email at:"
  },
  "edit": {
    "title": "User Profile",
    "subtitle": "General Information",
    "subtitle2": "Edit Your Profile",
    "text": "Details",
    "country": "Country",
    "branch": "Branch",
    "gender": "Gender",
    "modifytitle": "Modify user profile",
    "modifyuser": "Update your information",
    "name": "Name",
    "email": "Email",
    "age": "Age",
    "lang": "Language",
    "filiale":"Filiale IFCM",
    "loca":"Location",
    "adress":"Physical Address",
    "contact":"Contact",
    "media":"Social Media",
    "ifcmdetqil":"IFCM Branch Details",
    "selectcountry":"Select your country",
    "selectbranc":"Select your branch",
    "selectlang":"Select your language"
  },
  "orderpaymentshipping": {
    "title": "Payment method"
  },
  "orderpaymentteaching": {
    "title": "Checkout",
    "payment": "Payment",
    "confirmation": "Confirmation",
    "title2": "Payment method"
  },
  "ordershippingdetails": {
    "title": "Delivery Option",
    "clickandcollect": "CLICK AND COLLECT",
    "shop": "Bookshop",
    "adress": "Portion 35 or the Farm Tweefontein 523JQ Kromdraai Road, 1739 Johannesburg, South Africa",
    "num": "Tel:(+27) 11 334-4197 / 4615",
    "free": "Free",
    "order": "Order No",
    "current": "Current",
    "delivery": "Delivery",
    "free1": "FREE",
    "proceed": "Proceed to payment"
  },
  "paymentdonationconfirmation": {
    "title": "Checkout",
    "delivery": "Delivery",
    "confirmation": "Confirmation",
    "success": "Successful Donation",
    "thanks": "Thanks for your generosity",
    "don": "Donation",
    "next": "Order List"
  },
  "paymentshoppingconfirmation": {
    "title": "Checkout",
    "subtitle": "Order placed",
    "thanks": "Thanks for your purchase.",
    "order": "Order",
    "next": "Order List"
  },
  "paymentteachingconfirmation": {
    "title": "Checkout",
    "delivery": "Delivery",
    "confirmation": "Confirmation",
    "unlock": "Teaching unlocked",
    "thanks": "Thanks for your purchase.",
    "order": "Order",
    "next": "Order List"
  },
  "welcomepage": {
    "slide1title": "​​PLACE TO CALL HOME",
    "slide1text": "Impact for Christ Ministries (IFCM) is a ministry of the Lord Jesus Christ, where His name is lifted up high and His limitless power demonstrated. This is done through the teaching of the Gospel of Truth, Prophecy and Evangelism while ministering deliverance to the oppressed.",
    "slide1text2": " John 14:12 - \"Doing the works of Jesus Christ.\" ",
    "slide2title": "​ Who is the Prophet Philip Banda?",
    "slide2textbold": "The Prophet to the Nations, a servant of the Almighty God, a great teacher of the Word, the Man of God, Prophet Philip Banda.",
    "slide2text2": "His distinct attributes are endless, a humble servant of God who loves, obeys, adores and respects God. He is more characterized by loving people, loving Israel and adoration for the Jewish Nation. ",
    "slide2text3": " The Prophet has taught and covered a wide range of Biblical subjects and practical topics that affect our daily lives in this generation. Everyone listening to his teachings, whether live service in church, ITVN, via webstream, listening to a recorded message on CD or DVD, reading ECHOES of God magazine or the Prophet’s books, is able to identify his or her problem as well as find the solution in the teaching. Through the direct and uncompromised truth that has been taught by the Prophet over the years, ",
    "slide2text4bold": "the Bible has been simplified to the young and old ",
    "slide2text5": ", to the theologians, politicians, presidents, directors, professionals, business people, graduates as well as the man on the street. ",
    "slide2text6": " To the Prophet, this is what he was born to do, ",
    "slide2text7bold": " to introduce the God of Israel to the people and to point the Nations to Jesus Christ. ",
    "slide2text8": " God Almighty has indeed blessed this generation with the Moses of its time. When reading the Bible, all the Kings of Israel had a Prophet behind them. Are we not a blessed generation to have a Prophet among us? ",
    "slide3title": "​Holy Land - the fullfillment of a vision",
    "slide3textbold": "Holy Land is the realization of the vision of the man of God, the prophet Philippe Banda.",
    "slide3text": "A holy land on African soil which offers all those who seek God a place of encounter with their Creator. Holy Land is a place of prayer, meditation, a blessed and sanctified place that has the sweet scent of Jerusalem. We are at home there.",
    "slide3taddress": " Address: Portion 35 of the Farm Tweefontein 523JQ, Kromdraai Road, Mogale City, 1739 ",
    "continuebtn": "CONTINUE"
  }
}